app/controllers/search_controller.rb

  def results
    @search_time = Time.now
    if params[:type] == 'basic'
      if not params[:term]
  	    flash[:error] = "No search terms specified!"
  	    redirect_to :controller => 'search'
  	  else
        term = term_parser params[:term]
        @prev_term = term
  	    @file_results = Fileentry.find_with_ferret params[:term], :page => params[:page], :per_page => PER_PAGE
---
SELECT * FROM `fileentries` WHERE (fileentries.id in ('478281','475760'))