app/controllers/userentries_controller.rb

  def browse
    # File browser for a user's files
    @path = '/'
    if params['path'] != nil
      @path += params['path']
    end
    @folder = Folderentry.all(:conditions => {:fullName => @path, :userId => params['id'].to_i})[0]
    @sub_folders = Folderentry.all(:conditions => {:parentId => @folder})
    @files = Fileentry.all(:conditions => {:folderId => @folder})
---
SELECT * FROM `folderentries` WHERE (`folderentries`.`userId` = 15 AND `folderentries`.`fullName` = '/Comedy')
SELECT * FROM `folderentries` WHERE (`folderentries`.`userId` IS NULL AND `folderentries`.`fullName` = '/foo' AND `folderentries`.`parentId` = 0)
SELECT * FROM `fileentries` WHERE (`fileentries`.`folderId` IN (NULL))